IdeaRS.OpenModel.Detail.ReinfBarOnEdge
Representing reinforcement bar input on edge in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.MasterEdge
Master edge on Outline of MasterComponent

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.NumOfLayers
Number of layers

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.Distance
Distance between reinforcement layers

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.EdgePositionType
Position of reinforcement on edge

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.PositionOnEdge
Position of beginning of bar from start or end of edge

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.Length
length of bar

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.AnchorLength
Anchor length of main bars, if MasterComponent is opening

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.ExtendTypeBegin
type of extension of beginning of bar

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.ExtendDistanceBegin
Distance of extension of beginning

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.ExtendTypeEnd
type of extension of end of bar

IdeaRS.OpenModel.Detail.ReinfBarOnEdge.ExtendDistanceEnd
Distance of extension of end